참고

ex_0211.ipynb

In [81]:
import pandas as pd
import numpy as np
import os

# 멀티 인덱스

In [82]:
my_header = ['a', 'b', 'c']

In [83]:
my_index_out = ['G1']*3 + ['G2']*3
my_index_out

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [84]:
my_index_in = [1, 2, 3]*2
my_index_in

[1, 2, 3, 1, 2, 3]

In [85]:
my_index_zipped = list(zip(my_index_out, my_index_in))
my_index_zipped

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [86]:
my_index = pd.MultiIndex.from_tuples(my_index_zipped)
my_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [87]:
pd.DataFrame(np.random.randn(3, 6), columns=my_index, index=my_header)

         G1                            G2
          1         2         3         1         2         3
a  1.304851 -1.115005 -0.756467 -0.494295  0.199059 -0.010850
b  0.133962  0.504639  1.559036  0.242417 -0.571104  1.470227
c  0.579546 -1.453267  0.711853 -0.170311  0.574506 -1.091653

In [88]:
df = pd.DataFrame(np.random.randn(6, 3), columns=my_header, index=my_index)
df

             a         b         c
G1 1 -1.756193  0.659026  1.534006
   2  0.082135 -0.945738  0.861410
   3  0.502001  1.181817 -0.399567
G2 1  1.234645  0.714478 -0.081050
   2 -0.262808  0.163934 -0.558249
   3  0.024021  0.970215  1.343600

# 슬라이싱

In [89]:
df['c']

G1  1    1.534006
    2    0.861410
    3   -0.399567
G2  1   -0.081050
    2   -0.558249
    3    1.343600
Name: c, dtype: float64

In [90]:
df.loc['G1']

          a         b         c
1 -1.756193  0.659026  1.534006
2  0.082135 -0.945738  0.861410
3  0.502001  1.181817 -0.399567

In [91]:
df.loc['G1'].loc[1]

a   -1.756193
b    0.659026
c    1.534006
Name: 1, dtype: float64

In [92]:
df.loc['G1']['b']

1    0.659026
2   -0.945738
3    1.181817
Name: b, dtype: float64

In [93]:
df.loc['G1'].loc[1, 'c']

1.534005749104608

# 그룹 연산

In [94]:
data = pd.read_csv('./data/data_studentlist_en.csv')
df = pd.DataFrame(data)

In [95]:
df.head()

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [96]:
df.groupby('gender').mean()

              age     grade      height     weight
gender
F       21.857143  1.714286  166.642857  50.442857
M       22.700000  2.700000  172.410000  68.500000

In [97]:
df[df.gender=='F'].height.mean()

166.64285714285714

In [98]:
df[df.gender=='M'].height.mean()

172.41000000000003

In [99]:
df.groupby('gender')[['height', 'weight']].mean()

            height     weight
gender
F       166.642857  50.442857
M       172.410000  68.500000

In [100]:
df.groupby('gender')[['height', 'weight']].std()

          height    weight
gender
F       8.487414  3.907624
M       6.804647  9.505437

In [101]:
df.groupby('gender')[['height', 'weight']].min()

        height  weight
gender
F        155.2    45.2
M        162.2    55.3

In [102]:
df.groupby(['gender','bloodtype'])[['height']].mean()

                      height
gender bloodtype
F      A          172.450000
       AB         170.100000
       B          158.200000
       O          164.433333
M      A          165.700000
       AB         181.050000
       B          174.550000
       O          166.200000

In [103]:
dfr = df.groupby(['gender','bloodtype'])[['height', 'weight']].mean()

dfr

                      height     weight
gender bloodtype
F      A          172.450000  52.250000
       AB         170.100000  53.000000
       B          158.200000  45.200000
       O          164.433333  50.133333
M      A          165.700000  58.750000
       AB         181.050000  80.750000
       B          174.550000  68.950000
       O          166.200000  65.100000

In [104]:
dfr.loc['M'].loc['A']

height    165.70
weight     58.75
Name: A, dtype: float64

In [105]:
dfr.loc['M'].loc['A'].height

165.7

In [106]:
# SQL 문
'''
SELECT AVG(height) FROM df GROUP BY gender;
'''

df.groupby('gender').height.mean()

gender
F    166.642857
M    172.410000
Name: height, dtype: float64

위 형식 같은 문제가 퀴즈에 나올 수 있음

In [107]:
# 시리즈의 경우
sr = df.groupby(['gender','bloodtype'])['height'].mean()
sr

gender  bloodtype
F       A            172.450000
        AB           170.100000
        B            158.200000
        O            164.433333
M       A            165.700000
        AB           181.050000
        B            174.550000
        O            166.200000
Name: height, dtype: float64

In [108]:
sr.loc['F'].loc['A']

172.45

In [109]:
sr['F']['A']

172.45

In [110]:
sr['M']['AB']

181.05

# apply 함수, sort_values 함수 등

## apply()

In [111]:
df.height.apply(lambda x: x/100)

0     1.653
1     1.701
2     1.750
3     1.821
4     1.680
5     1.620
6     1.552
7     1.769
8     1.785
9     1.761
10    1.671
11    1.800
12    1.622
13    1.761
14    1.582
15    1.686
16    1.692
Name: height, dtype: float64

In [112]:
# 원본 객체는 그대로
df.height

0     165.3
1     170.1
2     175.0
3     182.1
4     168.0
5     162.0
6     155.2
7     176.9
8     178.5
9     176.1
10    167.1
11    180.0
12    162.2
13    176.1
14    158.2
15    168.6
16    169.2
Name: height, dtype: float64

## sort_values()

정렬

In [113]:
df.sort_values(by='age')[:3]

                name gender  age  grade absence bloodtype  height  weight
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
16      Andrew Daley      M   21      1       N         A   169.2    62.2
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0

In [114]:
df.sort_values(by='gender')[:3]

                name gender  age  grade absence bloodtype  height  weight
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
14      Linda Carter      F   22      2       N         B   158.2    45.2
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1

In [115]:
df.sort_values(by='age', ascending=False)[:3]

              name gender  age  grade absence bloodtype  height  weight
2     Brian Martin      M   24      4       N         B   175.0    80.1
15  Richard Swayze      M   24      4       Y         B   168.6    70.2
10   Joshua Connor      M   24      4       Y         O   167.1    62.0

In [116]:
df.sort_values(by=['bloodtype', 'age'])[:5]

               name gender  age  grade absence bloodtype  height  weight
4   Clara Rodriquez      F   20      1       Y         A   168.0    49.5
12     Eddy Johnson      M   21      1       N         A   162.2    55.3
16     Andrew Daley      M   21      1       N         A   169.2    62.2
7   Margareth Jones      F   23      1       N         A   176.9    55.0
1    Sarah O'Donnel      F   22      2       N        AB   170.1    53.0

In [117]:
df.sort_values(by=['bloodtype', 'age'], ascending=['True', 'False'])[:5]

               name gender  age  grade absence bloodtype  height  weight
4   Clara Rodriquez      F   20      1       Y         A   168.0    49.5
12     Eddy Johnson      M   21      1       N         A   162.2    55.3
16     Andrew Daley      M   21      1       N         A   169.2    62.2
7   Margareth Jones      F   23      1       N         A   176.9    55.0
1    Sarah O'Donnel      F   22      2       N        AB   170.1    53.0

### reset_index()

DataFrame의 열의 리셋

인덱스를 리셋 시키는데 사용

기본값으로 인덱스 값들을 DataFrame의 열로 전송하며, 새로운 단순한 정수 인덱스를 세팅한다. 

옵션
    - drop: 인덱스로 세팅한 열을 DataFrame내에서 삭제할지 여부를 결정

In [118]:
# index 리셋
df.sort_values(by=['bloodtype', 'age'], ascending=['True', 'False']).reset_index(drop=True)

                name gender  age  grade absence bloodtype  height  weight
0    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
1       Eddy Johnson      M   21      1       N         A   162.2    55.3
2       Andrew Daley      M   21      1       N         A   169.2    62.2
3    Margareth Jones      F   23      1       N         A   176.9    55.0
4     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
5       John Matsuda      M   22      2       N        AB   180.0    75.8
6       David Hassel      M   23      3       N        AB   182.1    85.7
7     Jake Timmerman      M   22      2       N         B   176.1    61.3
8       Linda Carter      F   22      2       N         B   158.2    45.2
9       John Bertsch      M   23      3       N         B   178.5    64.2
10      Brian Martin      M   24      4       N         B   175.0    80.1
11    Richard Swayze      M   24      4       Y         B   168.6    70.2
12  Jennifer Lorentz      F   21      2       N         O   162.0    52.0
13       Susan Clark      F   22      1       N         O   155.2    45.3
14     Jared Diamond      M   23      3       Y         O   165.3    68.2
15  Rebecah Anderson      F   23      3       N         O   176.1    53.1
16     Joshua Connor      M   24      4       Y         O   167.1    62.0

In [119]:
df.bloodtype.unique()

array(['O', 'AB', 'B', 'A'], dtype=object)

In [120]:
df.bloodtype.nunique()

4

In [121]:
df.bloodtype.mode()

0    B
1    O
dtype: object

# 피벗 테이블

In [122]:
df.groupby('gender')[['height']].mean()

            height
gender
F       166.642857
M       172.410000

In [123]:
# default 가 np.mean

# pd.pivot_table(df, index=['gender'], values='height', aggfunc=np.mean)

pd.pivot_table(df, index=['gender'], values='height')

            height
gender
F       166.642857
M       172.410000

In [124]:
pd.pivot_table(df, index=['gender'], values=['height', 'weight'])

            height     weight
gender
F       166.642857  50.442857
M       172.410000  68.500000

In [125]:
pd.pivot_table(df, index=['gender', 'bloodtype'], values=['height', 'weight'])

                      height     weight
gender bloodtype
F      A          172.450000  52.250000
       AB         170.100000  53.000000
       B          158.200000  45.200000
       O          164.433333  50.133333
M      A          165.700000  58.750000
       AB         181.050000  80.750000
       B          174.550000  68.950000
       O          166.200000  65.100000

- group by 한것과 pivot table 한것이 같아 보인다.

In [126]:
pd.pivot_table(df, index=['gender'], columns=['bloodtype'], values=['height'])

           height
bloodtype       A      AB       B           O
gender
F          172.45  170.10  158.20  164.433333
M          165.70  181.05  174.55  166.200000

In [127]:
pd.pivot_table(df, index=['gender'], columns=['absence', 'bloodtype'], values=['height'])

          height
absence        N                                      Y
bloodtype      A      AB           B           O      A      B      O
gender
F          176.9  170.10  158.200000  164.433333  168.0    NaN    NaN
M          165.7  181.05  176.533333         NaN    NaN  168.6  166.2

In [128]:
pd.pivot_table(df, index=['gender'], columns=['absence', 'bloodtype'], values=['height'], fill_value=0)

          height
absence        N                                    Y
bloodtype      A      AB           B           O    A      B      O
gender
F          176.9  170.10  158.200000  164.433333  168    0.0    0.0
M          165.7  181.05  176.533333    0.000000    0  168.6  166.2

In [129]:
pd.pivot_table(df, index=['gender'], values=['height', 'weight'])

            height     weight
gender
F       166.642857  50.442857
M       172.410000  68.500000

In [130]:
# 집계 방식을 서로 다르게 정할 수 있다.
pd.pivot_table(df, index=['gender'], values=['height', 'weight'], aggfunc={'height':np.mean, 'weight':np.median})

            height  weight
gender
F       166.642857    52.0
M       172.410000    66.2

## 예시 데이터

In [131]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo", "bar", "bar", "bar", "bar"], 
                   "B": ["one", "one", "one", "two", "two", "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small", "small", "large", "small", "small", "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9